#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
#include<stdlib.h>
#include<math.h>

int main0901()
{
	//~按位取反   将各个二进制为取反 0变成1 1变成0   优先级别在第二位
	//char a = 10;
	///*
	//0000 1010   补码
	//~a
	//1111 0101   补码 -1反码
	//1111 0100   反码 取反原码
	//1000 1011  -11
	//*/
	//a = ~a;

	//char a = 69;
	//a = ~a;
	///*
	//0100 0101
	//1011 1010  补码
	//1011 1001  反码
	//1100 0110  -70
	//*/
	char a = -89;
	a = ~a;
	/*
	1101 1001
	1010 0110
	1010 0111  补码

	~a
	0101 1000 88

	
	*/

	printf("%d\n", a);

	return EXIT_SUCCESS;
}

int main0902()
{
	//&按位与  二进制位各个位数如果都是1结果为1 否则为0  同真为真 其余为假  优先级别第八位
	//char a = 10;
	//char b = 89;
	///*
	//0000 1010
	//0101 1001
	//
	//0000 1000
	//*/
	//char c = a&b;



	//char a = 67;
	//char b = -38;
	//char c = a&b;
	/*
	0100 0011
	1010 0110
	1101 1001
	1101 1010  补码
	


	0100 0011
	1101 1010 
	0100 0010  66
	*/



	char a = -98;
	char b = -121;
	char c = a&b;

	/*
	1110 0010
	1001 1101
	1001 1110  补码

	1111 1001
	1000 0110
	1000 0111  补码

	
	1001 1110
	1000 0111
	1000 0110  补码
	1000 0101  反码
	1111 1010  原码

	*/

	printf("%d\n", c);
	return 0;
}

int main0903(void)
{

	// |按位或  二进制各个位如果有一个为1  结果为1  否则为0  优先级别第十位
	//char a = 10;
	//char b = 54;
	//char c = a | b;
	/*
	0000 1010
	0011 0110

	0011 1110  62
	*/


	char a = -82;
	char b = 94;
	char c = a | b;
	/*
	1101 0010
	1010 1101
	1010 1110
	0101 1110

	1111 1110  补码
	1111 1101  反码
	1000 0010  原码

	*/

	printf("%d\n", c);




	return 0;

}

int  main0904(void)
{

	//按位异或  二进制位各个位数相同为0  不同为1  优先级别第九位
	//char a = 10;
	//char b = 20;

	//char c = a^b;

	/*
	0000 1010
	0001 0100

	0001 1110  30
	
	*/


	char a = 10;
	char b = -20;
	/*
	0000 1010
	1001 0100
	1110 1011
	1110 1100
	


	0000 1010
	1110 1100

	1110 0110  补码
	1110 0101  反码
	1001 1010 -26

	*/
	char c = a^b;
	printf("%d\n", c);


}