#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
#include<stdlib.h>
#include<math.h>

int main12()
{
	////三维数组
	//int arr[2][3][4]=
	//{
	//	{
	//		{1,2,3,4},
	//		{2,3,4,5},
	//		{3,4,5,6}
	//	},
	//	{
	//		{4,5,6,7},
	//		{5,6,7,8},
	//		{6,7,8,9}
	//	}
	//};


	////for (int i = 0; i < 2; i++)
	////{
	////	for (int j = 0; j < 3; j++)
	////	{
	////		for (int k = 0; k < 4; k++)
	////		{
	////			printf("%d ", arr[i][j][k]);
	////		}
	////		printf("\n");
	////	}
	////}

	////三维数组大小：
	//printf("%d\n", sizeof(arr));
	////三维数组层数：
	//printf("%d\n", sizeof(arr[0]));
	////层数：数组大小/数组层数
	////sizeof(arr) / sizeof(arr[0]);
	////三维数组行数：
	//printf("%d\n", sizeof(arr[0][0]));
	////行数：层数/行数
	////sizoef(arr[0])/sizeof(arr[0][0]);
	////三维数组列数：
	//printf("%d\n", sizeof(arr[0][0][0]));
	////列数：行数/列数
	////sizeof(arr[0][0])/sizeof(arr[0][0][0]);
	////三维数组元素大小：

	////三维数组应用：1、游戏三维坐标   2、地图开发


	int arr[2][3][4][5]=
	{
		{
			{
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 }
			},
			{
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 }
			},
			{
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 }
			}
		},
		{
			{
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 }
			},
			{
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 }
			},
			{
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 },
				{ 1,1,1,1,1 }
			}
		}
	};

	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			for (int k = 0; k < 4; k++)
			{
				for (int l = 0; l < 5; l++)
				{
					printf("%d ", arr[i][j][k][l]);
				}
				printf("\n");
			}
		}
	}
	printf("%d\n", sizeof(arr));

	return EXIT_SUCCESS;
}